IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC0_CFG_CONTROLSS_ADC0_CFG.xml
	<register id="CONTROLSS_ADC0_CFG_ADCINTSEL1N2" acronym="CONTROLSS_ADC0_CFG_ADCINTSEL1N2" offset="0xE" width="16" description="">
		<bitfield id="INT2CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT2 Continue to Interrupt Mode   0  No further ADCINT2 pulses are generated until ADCINT2 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT2E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT2 Interrupt Enable   0  ADCINT2 is disabled   1  ADCINT2 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT2SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT2 EOC Source Select   0h  EOC0 is trigger for ADCINT2   1h  EOC1 is trigger for ADCINT2   2h  EOC2 is trigger for ADCINT2   3h  EOC3 is trigger for ADCINT2   4h  EOC4 is trigger for ADCINT2   5h  EOC5 is trigger for ADCINT2   6h  EOC6 is trigger for ADCINT2   7h  EOC7 is trigger for ADCINT2   8h  EOC8 is trigger for ADCINT2   9h  EOC9 is trigger for ADCINT2   Ah  EOC10 is trigger for ADCINT2   Bh  EOC11 is trigger for ADCINT2   Ch  EOC12 is trigger for ADCINT2   Dh  EOC13 is trigger for ADCINT2   Eh  EOC14 is trigger for ADCINT2   Fh  EOC15 is trigger for ADCINT2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT1CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT1 Continue to Interrupt Mode   0  No further ADCINT1 pulses are generated until ADCINT1 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT1E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT1 Interrupt Enable   0  ADCINT1 is disabled   1  ADCINT1 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT1SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT1 EOC Source Select   0h  EOC0 is trigger for ADCINT1   1h  EOC1 is trigger for ADCINT1   2h  EOC2 is trigger for ADCINT1   3h  EOC3 is trigger for ADCINT1   4h  EOC4 is trigger for ADCINT1   5h  EOC5 is trigger for ADCINT1   6h  EOC6 is trigger for ADCINT1   7h  EOC7 is trigger for ADCINT1   8h  EOC8 is trigger for ADCINT1   9h  EOC9 is trigger for ADCINT1   Ah  EOC10 is trigger for ADCINT1   Bh  EOC11 is trigger for ADCINT1   Ch  EOC12 is trigger for ADCINT1   Dh  EOC13 is trigger for ADCINT1   Eh  EOC14 is trigger for ADCINT1   Fh  EOC15 is trigger for ADCINT1" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINTSEL3N4" acronym="CONTROLSS_ADC0_CFG_ADCINTSEL3N4" offset="0x10" width="16" description="">
		<bitfield id="INT4CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT4 Continue to Interrupt Mode   0  No further ADCINT4 pulses are generated until ADCINT4 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT4E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT4 Interrupt Enable   0  ADCINT4 is disabled   1  ADCINT4 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT4SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT4 EOC Source Select   0h  EOC0 is trigger for ADCINT4   1h  EOC1 is trigger for ADCINT4   2h  EOC2 is trigger for ADCINT4   3h  EOC3 is trigger for ADCINT4   4h  EOC4 is trigger for ADCINT4   5h  EOC5 is trigger for ADCINT4   6h  EOC6 is trigger for ADCINT4   7h  EOC7 is trigger for ADCINT4   8h  EOC8 is trigger for ADCINT4   9h  EOC9 is trigger for ADCINT4   Ah  EOC10 is trigger for ADCINT4   Bh  EOC11 is trigger for ADCINT4   Ch  EOC12 is trigger for ADCINT4   Dh  EOC13 is trigger for ADCINT4   Eh  EOC14 is trigger for ADCINT4   Fh  EOC15 is trigger for ADCINT4" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT3CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT3 Continue to Interrupt Mode   0  No further ADCINT3 pulses are generated until ADCINT3 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT3E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT3 Interrupt Enable   0  ADCINT3 is disabled   1  ADCINT3 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT3SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT3 EOC Source Select   0h  EOC0 is trigger for ADCINT3   1h  EOC1 is trigger for ADCINT3   2h  EOC2 is trigger for ADCINT3   3h  EOC3 is trigger for ADCINT3   4h  EOC4 is trigger for ADCINT3   5h  EOC5 is trigger for ADCINT3   6h  EOC6 is trigger for ADCINT3   7h  EOC7 is trigger for ADCINT3   8h  EOC8 is trigger for ADCINT3   9h  EOC9 is trigger for ADCINT3   Ah  EOC10 is trigger for ADCINT3   Bh  EOC11 is trigger for ADCINT3   Ch  EOC12 is trigger for ADCINT3   Dh  EOC13 is trigger for ADCINT3   Eh  EOC14 is trigger for ADCINT3   Fh  EOC15 is trigger for ADCINT3" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCSOCPRICTL" acronym="CONTROLSS_ADC0_CFG_ADCSOCPRICTL" offset="0x12" width="16" description="">
		<bitfield id="RRPOINTER" width="5" begin="9" end="5" resetval="0x16" description="Round Robin Pointer. Holds the value of the last converted round robin SOCx to be used by the round robin scheme to determine order of conversions.   00h  SOC0 was last round robin SOC to convert, SOC1 is highest round robin priority.   01h  SOC1 was last round robin SOC to convert, SOC2 is highest round robin priority.   02h  SOC2 was last round robin SOC to convert, SOC3 is highest round robin priority.   03h  SOC3 was last round robin SOC to convert, SOC4 is highest round robin priority.   04h  SOC4 was last round robin SOC to convert, SOC5 is highest round robin priority.   05h  SOC5 was last round robin SOC to convert, SOC6 is highest round robin priority.   06h  SOC6 was last round robin SOC to convert, SOC7 is highest round robin priority.   07h  SOC7 was last round robin SOC to convert, SOC8 is highest round robin priority.   08h  SOC8 was last round robin SOC to convert, SOC9 is highest round robin priority.   09h  SOC9 was last round robin SOC to convert, SOC10 is highest round robin priority.   0Ah  SOC10 was last round robin SOC to convert, SOC11 is highest round robin priority.   0Bh  SOC11 was last round robin SOC to convert, SOC12 is highest round robin priority.   0Ch  SOC12 was last round robin SOC to convert, SOC13 is highest round robin priority.   0Dh  SOC13 was last round robin SOC to convert, SOC14 is highest round robin priority.   0Eh  SOC14 was last round robin SOC to convert, SOC15 is highest round robin priority.   0Fh  SOC15 was last round robin SOC to convert, SOC0 is highest round robin priority.   10h  Reset value to indicate no SOC has been converted. SOC0 is highest round robin priority. Set to this value when the device is reset, when the ADCCTL1.RESET bit is set, or when the ADCSOCPRICTL register is written. In the latter case, if a conversion is currently in progress, it will complete and then the new priority will take effect. Others  Invalid value." range="9 - 5" rwaccess="RO"/> 
		<bitfield id="SOCPRIORITY" width="5" begin="4" end="0" resetval="0x0" description="SOC Priority Determines the cutoff point for priority mode and round robin arbitration for SOCx   00h  SOC priority is handled in round robin mode for all channels.   01h  SOC0 is high priority, rest of channels are in round robin mode.   02h  SOC0-SOC1 are high priority, SOC2-SOC15 are in round robin mode.   03h  SOC0-SOC2 are high priority, SOC3-SOC15 are in round robin mode.   04h  SOC0-SOC3 are high priority, SOC4-SOC15 are in round robin mode.   05h  SOC0-SOC4 are high priority, SOC5-SOC15 are in round robin mode.   06h  SOC0-SOC5 are high priority, SOC6-SOC15 are in round robin mode.   07h  SOC0-SOC6 are high priority, SOC7-SOC15 are in round robin mode.   08h  SOC0-SOC7 are high priority, SOC8-SOC15 are in round robin mode.   09h  SOC0-SOC8 are high priority, SOC9-SOC15 are in round robin mode.   0Ah  SOC0-SOC9 are high priority, SOC10-SOC15 are in round robin mode.   0Bh  SOC0-SOC10 are high priority, SOC11-SOC15 are in round robin mode.   0Ch  SOC0-SOC11 are high priority, SOC12-SOC15 are in round robin mode.   0Dh  SOC0-SOC12 are high priority, SOC13-SOC15 are in round robin mode.   0Eh  SOC0-SOC13 are high priority, SOC14-SOC15 are in round robin mode.   0Fh  SOC0-SOC14 are high priority, SOC15 is in round robin mode.   10h  All SOCs are in high priority mode, arbitrated by SOC number. Others  Invalid selection." range="4 - 0" rwaccess="RW"/>
	</register>
