IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC0_CFG_CONTROLSS_ADC0_CFG.xml
	<register id="CONTROLSS_ADC0_CFG_ADCSOC14CTL" acronym="CONTROLSS_ADC0_CFG_ADCSOC14CTL" offset="0x58" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC14 Trigger Source Select. Along with the SOC14 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC14 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC14 Channel Select. Selects the channel to be converted when SOC14 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC14 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCSOC15CTL" acronym="CONTROLSS_ADC0_CFG_ADCSOC15CTL" offset="0x5C" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC15 Trigger Source Select. Along with the SOC15 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC15 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC15 Channel Select. Selects the channel to be converted when SOC15 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC15 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCEVTSTAT" acronym="CONTROLSS_ADC0_CFG_ADCEVTSTAT" offset="0x60" width="16" description="">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Flag. When set indicates the ADCPPB4RESULT register has changed sign. This bit is gated by EOC signal." range="14" rwaccess="RO"/> 
		<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Flag. When set indicates a digital compare trip low event has occurred." range="13" rwaccess="RO"/> 
		<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Flag. When set indicates a digital compare trip high event has occurred." range="12" rwaccess="RO"/> 
		<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Flag. When set indicates the ADCPPB3RESULT register has changed sign. This bit is gated by EOC signal." range="10" rwaccess="RO"/> 
		<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Flag. When set indicates a digital compare trip low event has occurred." range="9" rwaccess="RO"/> 
		<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Flag. When set indicates a digital compare trip high event has occurred." range="8" rwaccess="RO"/> 
		<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Flag. When set indicates the ADCPPB2RESULT register has changed sign. This bit is gated by EOC signal." range="6" rwaccess="RO"/> 
		<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Flag. When set indicates a digital compare trip low event has occurred." range="5" rwaccess="RO"/> 
		<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Flag. When set indicates a digital compare trip high event has occurred." range="4" rwaccess="RO"/> 
		<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Flag. When set indicates the ADCPPB1RESULT register has changed sign. This bit is gated by EOC signal." range="2" rwaccess="RO"/> 
		<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Flag. When set indicates a digital compare trip low event has occurred." range="1" rwaccess="RO"/> 
		<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Flag. When set indicates a digital compare trip high event has occurred." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCEVTCLR" acronym="CONTROLSS_ADC0_CFG_ADCEVTCLR" offset="0x64" width="16" description="">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register." range="14" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register." range="13" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register." range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register." range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register." range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register." range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register." range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register." range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register." range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCEVTSEL" acronym="CONTROLSS_ADC0_CFG_ADCEVTSEL" offset="0x68" width="16" description="">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="14" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="13" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="12" rwaccess="RW"/> 
		<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="10" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="9" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="8" rwaccess="RW"/> 
		<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="6" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="5" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="4" rwaccess="RW"/> 
		<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="2" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="1" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCEVTINTSEL" acronym="CONTROLSS_ADC0_CFG_ADCEVTINTSEL" offset="0x6C" width="16" description="">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="14" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="13" rwaccess="RW"/> 
		<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="12" rwaccess="RW"/> 
		<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="10" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="9" rwaccess="RW"/> 
		<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="8" rwaccess="RW"/> 
		<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="6" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="5" rwaccess="RW"/> 
		<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="4" rwaccess="RW"/> 
		<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="2" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="1" rwaccess="RW"/> 
		<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCOSDETECT" acronym="CONTROLSS_ADC0_CFG_ADCOSDETECT" offset="0x70" width="16" description="">
		<bitfield id="DETECTCFG" width="3" begin="2" end="0" resetval="0x0" description="ADC Opens and Shorts Detect Configuration. This bit field defines the open/shorts detection circuit state.    0h  Open/Shorts detection circuit is disabled.   1h  Open/Shorts detection circuit is enabled at zero scale.   2h  Open/Shorts detection circuit is enabled at full scale.   3h  Open/Shorts detection circuit is enabled at (nominal) 5/12 scale.   4h  Open/Shorts detection circuit is enabled at (nominal) 7/12 scale.   5h  Open/Shorts detection circuit is enabled with a (nominal) 5K pulldown to VSSA.   6h  Open/Shorts detection circuit is enabled with a (nominal) 5K pullup to VDDA.   7h  Open/Shorts detection circuit is enabled with a (nominal) 7K pulldown to VSSA." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCCOUNTER" acronym="CONTROLSS_ADC0_CFG_ADCCOUNTER" offset="0x72" width="16" description="">
		<bitfield id="FREECOUNT" width="12" begin="11" end="0" resetval="0x0" description="ADC Free Running Counter Value. This bit field reflects the status of the free running ADC counter." range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCREV" acronym="CONTROLSS_ADC0_CFG_ADCREV" offset="0x74" width="16" description="">
		<bitfield id="REV" width="8" begin="15" end="8" resetval="0x1" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h." range="15 - 8" rwaccess="RO"/> 
		<bitfield id="TYPE" width="8" begin="7" end="0" resetval="0x5" description="ADC Type. Always set to 5 for this ADC." range="7 - 0" rwaccess="RO"/>
	</register>
