IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC0_CFG_CONTROLSS_ADC0_CFG.xml
	<register id="CONTROLSS_ADC0_CFG_ADCPPB4STAMP" acronym="CONTROLSS_ADC0_CFG_ADCPPB4STAMP" offset="0xB2" width="16" description="">
		<bitfield id="DLYSTAMP" width="12" begin="11" end="0" resetval="0x0" description="ADC Post Processing Block 4 Delay Time Stamp. When an SOC starts sampling the value contained in REQSTAMP is subtracted from the value in ADCCOUNTER.FREECOUNT and loaded into this bit field, thereby giving the number of system clock cycles delay between the SOC trigger and the actual start of the sample." range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCPPB4OFFCAL" acronym="CONTROLSS_ADC0_CFG_ADCPPB4OFFCAL" offset="0xB4" width="16" description="">
		<bitfield id="OFFCAL" width="10" begin="9" end="0" resetval="0x0" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 10-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register.    000h  No change. The ADC output is stored directly into ADCRESULT.   001h  ADC output - 1 is stored into ADCRESULT.   002h  ADC output - 2 is stored into ADCRESULT.   ...   200h  ADC output + 512 is stored into ADCRESULT.   ...   3FFh  ADC output + 1 is stored into ADCRESULT.  NOTE: In 16-bit mode, the subtraction will saturate at 0000h and FFFFh before being stored into the ADCRESULT register. In 12-bit mode, the subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCPPB4OFFREF" acronym="CONTROLSS_ADC0_CFG_ADCPPB4OFFREF" offset="0xB6" width="16" description="">
		<bitfield id="OFFREF" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 16-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB4RESULT register. This subtraction is not saturated.    0000h  No change. The ADCRESULT value is passed on.   0001h  ADCRESULT - 1 is passed on.   0002h  ADCRESULT - 2 is passed on.   ...   8000h  ADCRESULT - 32,768 is passed on.   ...   FFFFh  ADCRESULT - 65,535 is passed on.  NOTE: In 12-bit mode the size of this register does not change from 16-bits. It is the user's responsibility to ensure that only a 12-bit value is written to this register when in 12-bit mode." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCPPB4TRIPHI" acronym="CONTROLSS_ADC0_CFG_ADCPPB4TRIPHI" offset="0xB8" width="32" description="">
		<bitfield id="HSIGN" width="1" begin="16" end="16" resetval="0x0" description="High Limit Sign Bit. This is the sign bit (17th bit) to the LIMITHI bit field when in 16-bit ADC mode." range="16" rwaccess="RW"/> 
		<bitfield id="LIMITHI" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 4 Trip High Limit. This value sets the digital comparator trip high limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB4RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRESULT bit field of the ADCPPB4RESULT register." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCPPB4TRIPLO" acronym="CONTROLSS_ADC0_CFG_ADCPPB4TRIPLO" offset="0xBC" width="32" description="">
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 4 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31 - 20" rwaccess="RO"/> 
		<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit (17th bit) to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="RW"/> 
		<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 4 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB4RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB4RESULT register." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINTCYCLE" acronym="CONTROLSS_ADC0_CFG_ADCINTCYCLE" offset="0xDE" width="16" description="">
		<bitfield id="DELAY" width="16" begin="15" end="0" resetval="0x0" description="ADC Early Interrupt Generation Cycle Delay: Defines the delay from the fall edge of ADCSOC in terms of system clock cycles, for the interrupt to be generated." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM1" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM1" offset="0xE0" width="32" description="">
		<bitfield id="INLTRIM31TO0" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 31-0.  This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM2" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM2" offset="0xE4" width="32" description="">
		<bitfield id="INLTRIM63TO32" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 63-32.    This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
