IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC0_CFG_CONTROLSS_ADC0_CFG.xml
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM3" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM3" offset="0xE8" width="32" description="">
		<bitfield id="INLTRIM95TO64" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 95-64.    This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM4" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM4" offset="0xEC" width="32" description="">
		<bitfield id="INLTRIM127TO96" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 127-96.    This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM5" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM5" offset="0xF0" width="32" description="">
		<bitfield id="INLTRIM159TO128" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 159-128.    This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIM6" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIM6" offset="0xF4" width="32" description="">
		<bitfield id="INLTRIM191TO160" width="32" begin="31" end="0" resetval="0x12648430" description="ADC Linearity Trim Bits 191-160.    This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC0_CFG_ADCINLTRIMCTL" acronym="CONTROLSS_ADC0_CFG_ADCINLTRIMCTL" offset="0xFC" width="32" description="">
		<bitfield id="KEY" width="16" begin="31" end="16" resetval="0x0" description="ADC Linearity Trim Control Write Key. Any write to this register must contain the value 0xA5A5 in these bit locations. If a write request attempts to load any other value into these bits, the write for the entire register is ignored. These bits always read back a zero." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CALIBSTEP" width="5" begin="5" end="1" resetval="0x0" description="ADC Linearity Calibration Step. Defines which of the 24 steps of calibration is to be executed. Never set this bit field while the ADC SELFTRIM is in progress. The R-M-W operation could unintentionally set the CALIBMODE bit again." range="5 - 1" rwaccess="RW"/> 
		<bitfield id="CALIBMODE" width="1" begin="0" end="0" resetval="0x0" description="ADC Linearity Calibration Mode." range="0" rwaccess="RW"/>
	</register>
</module>